app/controllers/registrations_controller.rb

	def create
		puts(params)
		user = User.new(name:params[:registrations][:name], last_name:params[:registrations][:last_name], phone:params[:registrations][:phone], email:params[:registrations][:email],
												password:params[:registrations][:password], address:params[:registrations][:address])
		if user.save()
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "address", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?)