app/controllers/users_controller.rb

  def create
    @user = User.create(user_params)
---
INSERT INTO "users" ("name", "last_name", "email", "phone", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?)

  def update
    @user = User.find(current_user.to_i)
    @user.update!(user_params)
---
SELECT  "users".* FROM "users" WHERE "users"."id" = ? LIMIT ?  [["id", 7], ["LIMIT", 1]]
UPDATE "users" SET "name" = ?, "last_name" = ?, "email" = ?, "password" = ?, "phone" = ?, "updated_at" = ? WHERE "users"."id" = ?  [["name", "Francisco"], ["last_name", "Borie"], ["email", "fjborie@miuandes.com"], ["password", "1234567890"], ["phone", "987654321"], ["updated_at", "2019-04-17 12:58:23.524847"], ["id", 9]]

  def destroy
    user_id = current_user
    User.delete(user_id.to_i)
---
DELETE FROM "users" WHERE "users"."id" = ?  [["id", 7]]